**Data Extraction & Dataframe Creation**

In [1]:
%pip install pandas
import pandas as pd
import numpy as np
import json
import os

Requirement already satisfied: pandas in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

***Agg_Transaction***

In [2]:
Agg_path = "D:/D26_Files/Phonepe_Analytics/pulse/data/aggregated/transaction/country/india/state/"
Agg_state_list = os.listdir(Agg_path)

agg_txn_data={'State':[], 'Year':[],'Quarter':[],'Transaction_type':[], 'Transaction_count':[], 'Transaction_amount':[]}

for state_name in Agg_state_list:
    state_path = Agg_path + state_name + "/"
    Agg_yr = os.listdir(state_path)
    
    for year in Agg_yr:
        year_path = state_path + year+ "/"
        Agg_yr_list = os.listdir(year_path)
        
        for quarter_file in Agg_yr_list:
            quarter_path = year_path + quarter_file
            Data = open(quarter_path,'r')
            D = json.load(Data)
            
            for category in D['data']['transactionData']:
              Name = category['name']
              Count = category['paymentInstruments'][0]['count']
              Amount = category['paymentInstruments'][0]['amount']
              
              agg_txn_data['Transaction_type'].append(Name)
              agg_txn_data['Transaction_count'].append(Count)
              agg_txn_data['Transaction_amount'].append(Amount)
              agg_txn_data['State'].append(state_name)
              agg_txn_data['Year'].append(year)
              agg_txn_data['Quarter'].append(int(quarter_file.strip('.json')))

Agg_Transaction_df = pd.DataFrame(agg_txn_data)

In [3]:
Agg_Transaction_df.head()

,State,Year,Quarter,Transaction_type,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,Recharge & bill payments,4200,1.845307e+06
1,andaman-&-nicobar-islands,2018,1,Peer-to-peer payments,1871,1.213866e+07
2,andaman-&-nicobar-islands,2018,1,Merchant payments,298,4.525072e+05
3,andaman-&-nicobar-islands,2018,1,Financial Services,33,1.060142e+04
4,andaman-&-nicobar-islands,2018,1,Others,256,1.846899e+05

In [4]:
Agg_Transaction_df.describe()

           Quarter  Transaction_count  Transaction_amount
count  5034.000000       5.034000e+03        5.034000e+03
mean      2.500795       4.673902e+07        6.863772e+10
std       1.118145       1.690968e+08        2.685200e+11
min       1.000000       2.000000e+00        3.439721e+01
25%       2.000000       5.808950e+04        3.993888e+07
50%       3.000000       5.158310e+05        4.394139e+08
75%       4.000000       1.166629e+07        1.102822e+10
max       4.000000       2.393918e+09        3.095666e+12

In [5]:
Agg_Transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5034 entries, 0 to 5033
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               5034 non-null   object
 1   Year                5034 non-null   object
 2   Quarter             5034 non-null   int64
 3   Transaction_type    5034 non-null   object
 4   Transaction_count   5034 non-null   int64
 5   Transaction_amount  5034 non-null   float64
dtypes: float64(1), int64(2), object(3)
memory usage: 236.1+ KB

In [6]:
Agg_Transaction_df.shape

(5034, 6)

In [7]:
Agg_Transaction_df.isnull().sum()

State                 0
Year                  0
Quarter               0
Transaction_type      0
Transaction_count     0
Transaction_amount    0
dtype: int64

In [8]:
Agg_Transaction_df['Year'] = Agg_Transaction_df['Year'].astype(int)
Agg_Transaction_df['State'] = Agg_Transaction_df['State'].str.replace('-', ' ').str.title()

In [9]:
Agg_Transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5034 entries, 0 to 5033
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               5034 non-null   object
 1   Year                5034 non-null   int64
 2   Quarter             5034 non-null   int64
 3   Transaction_type    5034 non-null   object
 4   Transaction_count   5034 non-null   int64
 5   Transaction_amount  5034 non-null   float64
dtypes: float64(1), int64(3), object(2)
memory usage: 236.1+ KB

In [10]:
Agg_Transaction_df['Transaction_type'].unique()

array(['Recharge & bill payments', 'Peer-to-peer payments',
       'Merchant payments', 'Financial Services', 'Others'], dtype=object)

In [11]:
Agg_Transaction_df['Quarter'].unique()

array([1, 2, 3, 4])

In [12]:
Agg_Transaction_df.head()

,State,Year,Quarter,Transaction_type,Transaction_count,Transaction_amount
0,Andaman & Nicobar Islands,2018,1,Recharge & bill payments,4200,1.845307e+06
1,Andaman & Nicobar Islands,2018,1,Peer-to-peer payments,1871,1.213866e+07
2,Andaman & Nicobar Islands,2018,1,Merchant payments,298,4.525072e+05
3,Andaman & Nicobar Islands,2018,1,Financial Services,33,1.060142e+04
4,Andaman & Nicobar Islands,2018,1,Others,256,1.846899e+05

***Map_Transaction***

In [13]:
Map_path = "D:/D26_Files/Phonepe_Analytics/pulse/data/map/transaction/hover/country/india/state/"
Map_state_list = os.listdir(Map_path)

Map_txn_data={'State':[], 'Year':[],'Quarter':[],'District_name':[], 'Transaction_count':[], 'Transaction_amount':[]}

for state_name in Map_state_list:
    state_path = Map_path + state_name + "/"
    Map_yr = os.listdir(state_path)
    
    for year in Map_yr:
        year_path = state_path + year+ "/"
        Map_yr_list = os.listdir(year_path)
        
        for quarter_file in Map_yr_list:
            quarter_path = year_path + quarter_file
            Data = open(quarter_path,'r')
            D = json.load(Data)
            
            for district in D['data']['hoverDataList']:
              Name = district['name']
              Count = district['metric'][0]['count']
              Amount = district['metric'][0]['amount']
              
              Map_txn_data['District_name'].append(Name)
              Map_txn_data['Transaction_count'].append(Count)
              Map_txn_data['Transaction_amount'].append(Amount)
              Map_txn_data['State'].append(state_name)
              Map_txn_data['Year'].append(year)
              Map_txn_data['Quarter'].append(int(quarter_file.strip('.json')))

Map_Transaction_df = pd.DataFrame(Map_txn_data)

In [14]:
Map_Transaction_df.head()

,State,Year,Quarter,District_name,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,north and middle andaman district,442,9.316631e+05
1,andaman-&-nicobar-islands,2018,1,south andaman district,5688,1.256025e+07
2,andaman-&-nicobar-islands,2018,1,nicobars district,528,1.139849e+06
3,andaman-&-nicobar-islands,2018,2,north and middle andaman district,825,1.317863e+06
4,andaman-&-nicobar-islands,2018,2,south andaman district,9395,2.394824e+07

In [15]:
Map_Transaction_df.describe()

            Quarter  Transaction_count  Transaction_amount
count  20604.000000       2.060400e+04        2.060400e+04
mean       2.505581       1.141935e+07        1.676967e+10
std        1.118047       4.534570e+07        5.655640e+10
min        1.000000       2.000000e+00        1.698886e+02
25%        2.000000       2.521455e+05        4.578292e+08
50%        3.000000       1.558070e+06        2.868918e+09
75%        4.000000       8.122777e+06        1.352423e+10
max        4.000000       1.674348e+09        1.790144e+12

In [16]:
Map_Transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20604 entries, 0 to 20603
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               20604 non-null  object
 1   Year                20604 non-null  object
 2   Quarter             20604 non-null  int64
 3   District_name       20604 non-null  object
 4   Transaction_count   20604 non-null  int64
 5   Transaction_amount  20604 non-null  float64
dtypes: float64(1), int64(2), object(3)
memory usage: 965.9+ KB

In [17]:
Map_Transaction_df['Year'] = Map_Transaction_df['Year'].astype(int)
Map_Transaction_df['State'] = Map_Transaction_df['State'].str.replace('-', ' ').str.title()
Map_Transaction_df['District_name'] = Map_Transaction_df['District_name'].str.title()

In [18]:
Map_Transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20604 entries, 0 to 20603
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               20604 non-null  object
 1   Year                20604 non-null  int64
 2   Quarter             20604 non-null  int64
 3   District_name       20604 non-null  object
 4   Transaction_count   20604 non-null  int64
 5   Transaction_amount  20604 non-null  float64
dtypes: float64(1), int64(3), object(2)
memory usage: 965.9+ KB

In [19]:
Map_Transaction_df.shape

(20604, 6)

In [20]:
Map_Transaction_df.isnull().sum()

State                 0
Year                  0
Quarter               0
District_name         0
Transaction_count     0
Transaction_amount    0
dtype: int64

In [21]:
Map_Transaction_df.head()

,State,Year,Quarter,District_name,Transaction_count,Transaction_amount
0,Andaman & Nicobar Islands,2018,1,North And Middle Andaman District,442,9.316631e+05
1,Andaman & Nicobar Islands,2018,1,South Andaman District,5688,1.256025e+07
2,Andaman & Nicobar Islands,2018,1,Nicobars District,528,1.139849e+06
3,Andaman & Nicobar Islands,2018,2,North And Middle Andaman District,825,1.317863e+06
4,Andaman & Nicobar Islands,2018,2,South Andaman District,9395,2.394824e+07

***Top_Transaction***

In [22]:
Top_path = "D:/D26_Files/Phonepe_Analytics/pulse/data/top/transaction/country/india/state/"
Top_state_list = os.listdir(Top_path)

Top_txn_data = { 'State': [], 'Year': [], 'Quarter': [], 'Entity_type': [],   'Entity_name': [],   'Transaction_count': [], 'Transaction_amount': []}

for state_name in Top_state_list:
    state_path = Top_path + state_name + "/"
    Top_yr = os.listdir(state_path)
    
    for year in Top_yr:
        year_path = state_path + year + "/"
        Top_yr_list = os.listdir(year_path)
        
        for quarter_file in Top_yr_list:
            quarter_path = year_path + quarter_file
            Data = open(quarter_path, 'r')
            D = json.load(Data)
            
            for entity_type in ['states', 'districts', 'pincodes']:
                if D['data'][entity_type] is not None:   
                    for record in D['data'][entity_type]:
                        Name = record['entityName']
                        Count = record['metric']['count']
                        Amount = record['metric']['amount']
                        
                        Top_txn_data['Entity_type'].append(entity_type[:-1])  
                        Top_txn_data['Entity_name'].append(Name)
                        Top_txn_data['Transaction_count'].append(Count)
                        Top_txn_data['Transaction_amount'].append(Amount)
                        Top_txn_data['State'].append(state_name)
                        Top_txn_data['Year'].append(year)
                        Top_txn_data['Quarter'].append(int(quarter_file.strip('.json')))

Top_Transaction_df = pd.DataFrame(Top_txn_data)

In [23]:
Top_Transaction_df.head()

,State,Year,Quarter,Entity_type,Entity_name,Transaction_count,Transaction_amount
0,andaman-&-nicobar-islands,2018,1,district,south andaman,5688,1.256025e+07
1,andaman-&-nicobar-islands,2018,1,district,nicobars,528,1.139849e+06
2,andaman-&-nicobar-islands,2018,1,district,north and middle andaman,442,9.316631e+05
3,andaman-&-nicobar-islands,2018,1,pincode,744101,1622,2.769298e+06
4,andaman-&-nicobar-islands,2018,1,pincode,744103,1223,2.238042e+06

In [24]:
Top_Transaction_df.describe()

            Quarter  Transaction_count  Transaction_amount
count  18295.000000       1.829500e+04        1.829500e+04
mean       2.500738       1.197467e+07        1.690444e+10
std        1.118040       4.962090e+07        6.277009e+10
min        1.000000       2.000000e+00        6.025276e+01
25%        2.000000       1.222215e+05        2.372684e+08
50%        3.000000       9.845220e+05        1.538457e+09
75%        4.000000       6.708908e+06        1.033093e+10
max        4.000000       1.674348e+09        1.790144e+12

In [25]:
Top_Transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18295 entries, 0 to 18294
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               18295 non-null  object
 1   Year                18295 non-null  object
 2   Quarter             18295 non-null  int64
 3   Entity_type         18295 non-null  object
 4   Entity_name         18293 non-null  object
 5   Transaction_count   18295 non-null  int64
 6   Transaction_amount  18295 non-null  float64
dtypes: float64(1), int64(2), object(4)
memory usage: 1000.6+ KB

In [26]:
Top_Transaction_df.shape

(18295, 7)

In [27]:
Top_Transaction_df.isnull().sum()

State                 0
Year                  0
Quarter               0
Entity_type           0
Entity_name           2
Transaction_count     0
Transaction_amount    0
dtype: int64

In [28]:
Top_Transaction_df[Top_Transaction_df.isnull().any(axis=1)]

,State,Year,Quarter,Entity_type,Entity_name,Transaction_count,Transaction_amount
8718,ladakh,2019,4,pincode,None,2014,1.009866e+07
8768,ladakh,2020,4,pincode,None,13717,3.671160e+07

In [29]:
Top_Transaction_df['Entity_name'] = Top_Transaction_df['Entity_name'].fillna("Unknown")

In [30]:
Top_Transaction_df.isnull().sum()

State                 0
Year                  0
Quarter               0
Entity_type           0
Entity_name           0
Transaction_count     0
Transaction_amount    0
dtype: int64

In [31]:
Top_Transaction_df['Year'] = Top_Transaction_df['Year'].astype(int)
Top_Transaction_df['Entity_type'] = Top_Transaction_df['Entity_type'].str.title()
Top_Transaction_df['Entity_name'] = Top_Transaction_df['Entity_name'].str.title()
Top_Transaction_df['State'] = Top_Transaction_df['State'].str.replace('-', ' ').str.title()

In [32]:
Top_Transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18295 entries, 0 to 18294
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   State               18295 non-null  object
 1   Year                18295 non-null  int64
 2   Quarter             18295 non-null  int64
 3   Entity_type         18295 non-null  object
 4   Entity_name         18295 non-null  object
 5   Transaction_count   18295 non-null  int64
 6   Transaction_amount  18295 non-null  float64
dtypes: float64(1), int64(3), object(3)
memory usage: 1000.6+ KB

In [33]:
Top_Transaction_df.head()

,State,Year,Quarter,Entity_type,Entity_name,Transaction_count,Transaction_amount
0,Andaman & Nicobar Islands,2018,1,District,South Andaman,5688,1.256025e+07
1,Andaman & Nicobar Islands,2018,1,District,Nicobars,528,1.139849e+06
2,Andaman & Nicobar Islands,2018,1,District,North And Middle Andaman,442,9.316631e+05
3,Andaman & Nicobar Islands,2018,1,Pincode,744101,1622,2.769298e+06
4,Andaman & Nicobar Islands,2018,1,Pincode,744103,1223,2.238042e+06

***Agg_Insurance_Transaction***

In [34]:
Insurance_path = "D:/D26_Files/Phonepe_Analytics/pulse/data/aggregated/insurance/country/india/state/"
Insurance_state_list = os.listdir(Insurance_path)

Insurance_data={'State':[], 'Year':[],'Quarter':[], 'Insurance_txn_count':[], 'Insurance_txn_amount':[]}

for state_name in Insurance_state_list:
    state_path = Insurance_path + state_name + "/"
    Insurance_yr = os.listdir(state_path)
    
    for year in Insurance_yr:
        year_path = state_path + year+ "/"
        Insurance_yr_list = os.listdir(year_path)
        
        for quarter_file in Insurance_yr_list:
            quarter_path = year_path + quarter_file
            with open(quarter_path,'r') as Data:
                D = json.load(Data)
            
            for category in D['data']['transactionData']:
              Count = category['paymentInstruments'][0]['count']
              Amount = category['paymentInstruments'][0]['amount']
              
              Insurance_data['Insurance_txn_count'].append(Count)
              Insurance_data['Insurance_txn_amount'].append(Amount)
              Insurance_data['State'].append(state_name)
              Insurance_data['Year'].append(year)
              Insurance_data['Quarter'].append(int(quarter_file.strip('.json')))

Insurance_Transaction_df = pd.DataFrame(Insurance_data)

In [35]:
Insurance_Transaction_df.head()

,State,Year,Quarter,Insurance_txn_count,Insurance_txn_amount
0,andaman-&-nicobar-islands,2020,2,6,1360.0
1,andaman-&-nicobar-islands,2020,3,41,15380.0
2,andaman-&-nicobar-islands,2020,4,124,157975.0
3,andaman-&-nicobar-islands,2021,1,225,244266.0
4,andaman-&-nicobar-islands,2021,2,137,181504.0

In [36]:
Insurance_Transaction_df.describe()

          Quarter  Insurance_txn_count  Insurance_txn_amount
count  682.000000           682.000000          6.820000e+02
mean     2.577713         21283.998534          2.934836e+07
std      1.092211         31503.745791          4.763085e+07
min      1.000000             4.000000          1.199000e+03
25%      2.000000           607.750000          8.211475e+05
50%      3.000000          6679.500000          6.675645e+06
75%      4.000000         29790.500000          3.730685e+07
max      4.000000        183532.000000          3.058618e+08

In [37]:
Insurance_Transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 682 entries, 0 to 681
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   State                 682 non-null    object
 1   Year                  682 non-null    object
 2   Quarter               682 non-null    int64
 3   Insurance_txn_count   682 non-null    int64
 4   Insurance_txn_amount  682 non-null    float64
dtypes: float64(1), int64(2), object(2)
memory usage: 26.8+ KB

In [38]:
Insurance_Transaction_df.isnull().sum()

State                   0
Year                    0
Quarter                 0
Insurance_txn_count     0
Insurance_txn_amount    0
dtype: int64

In [39]:
Insurance_Transaction_df.shape

(682, 5)

In [40]:
Insurance_Transaction_df['Year'] = Insurance_Transaction_df['Year'].astype(int)
Insurance_Transaction_df['State'] = Insurance_Transaction_df['State'].str.replace('-', ' ').str.title()

In [41]:
Insurance_Transaction_df.head()

,State,Year,Quarter,Insurance_txn_count,Insurance_txn_amount
0,Andaman & Nicobar Islands,2020,2,6,1360.0
1,Andaman & Nicobar Islands,2020,3,41,15380.0
2,Andaman & Nicobar Islands,2020,4,124,157975.0
3,Andaman & Nicobar Islands,2021,1,225,244266.0
4,Andaman & Nicobar Islands,2021,2,137,181504.0

***Agg_User***

In [42]:
Agg_User_path = "D:/D26_Files/Phonepe_Analytics/pulse/data/aggregated/user/country/india/state/"
Agg_User_state_list = os.listdir(Agg_User_path)

Agg_User_data = {'State':[], 'Year':[], 'Quarter':[], 'Registered_users':[], 'App_opens':[], 'Brand':[], 'Brand_count':[], 'Brand_percentage':[] }

for state_name in Agg_User_state_list:
    state_path = Agg_User_path + state_name + "/"
    Agg_User_yr = os.listdir(state_path)

    for year in Agg_User_yr:
        year_path = state_path + year + "/"
        Agg_User_yr_list = os.listdir(year_path)

        for quarter_file in Agg_User_yr_list:
            quarter_path = year_path + quarter_file
            with open(quarter_path, 'r') as Data:
                D = json.load(Data)

            reg_users = D['data']['aggregated']['registeredUsers']
            app_opens = D['data']['aggregated']['appOpens']

            for device in D['data'].get('usersByDevice') or []:
                brand = device['brand']
                count = device['count']
                percentage = device['percentage']

                Agg_User_data['State'].append(state_name)
                Agg_User_data['Year'].append(year)
                Agg_User_data['Quarter'].append(int(quarter_file.strip('.json')))
                Agg_User_data['Registered_users'].append(reg_users)
                Agg_User_data['App_opens'].append(app_opens)
                Agg_User_data['Brand'].append(brand)
                Agg_User_data['Brand_count'].append(count)
                Agg_User_data['Brand_percentage'].append(percentage)

Agg_User_df = pd.DataFrame(Agg_User_data)

In [43]:
Agg_User_df.head()

,State,Year,Quarter,Registered_users,App_opens,Brand,Brand_count,Brand_percentage
0,andaman-&-nicobar-islands,2018,1,6740,0,Xiaomi,1665,0.247033
1,andaman-&-nicobar-islands,2018,1,6740,0,Samsung,1445,0.214392
2,andaman-&-nicobar-islands,2018,1,6740,0,Vivo,982,0.145697
3,andaman-&-nicobar-islands,2018,1,6740,0,Oppo,501,0.074332
4,andaman-&-nicobar-islands,2018,1,6740,0,OnePlus,332,0.049258

In [44]:
Agg_User_df.describe()

,Quarter,Registered_users,App_opens,Brand_count,Brand_percentage
count,6732.000000,6.732000e+03,6.732000e+03,6.732000e+03,6732.000000
mean,2.411765,5.654126e+06,1.510069e+08,5.140115e+05,0.090909
std,1.140715,7.955764e+06,3.236699e+08,1.081772e+06,0.083401
min,1.000000,5.010000e+02,0.000000e+00,1.000000e+01,0.005158
25%,1.000000,1.918582e+05,0.000000e+00,9.354000e+03,0.020513
50%,2.000000,1.978676e+06,5.893784e+06,8.472250e+04,0.057718
75%,3.000000,8.393058e+06,1.496510e+08,4.555808e+05,0.146007
max,4.000000,4.822763e+07,2.570606e+09,1.134094e+07,0.478367

In [45]:
Agg_User_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6732 entries, 0 to 6731
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   State             6732 non-null   object
 1   Year              6732 non-null   object
 2   Quarter           6732 non-null   int64
 3   Registered_users  6732 non-null   int64
 4   App_opens         6732 non-null   int64
 5   Brand             6732 non-null   object
 6   Brand_count       6732 non-null   int64
 7   Brand_percentage  6732 non-null   float64
dtypes: float64(1), int64(4), object(3)
memory usage: 420.9+ KB

In [46]:
Agg_User_df.shape

(6732, 8)

In [47]:
Agg_User_df.isnull().sum()

State               0
Year                0
Quarter             0
Registered_users    0
App_opens           0
Brand               0
Brand_count         0
Brand_percentage    0
dtype: int64

In [48]:
Agg_User_df['Year'] = Agg_User_df['Year'].astype(int)
Agg_User_df['State'] = Agg_User_df['State'].str.replace('-', ' ').str.title()

In [49]:
Agg_User_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6732 entries, 0 to 6731
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   State             6732 non-null   object
 1   Year              6732 non-null   int64
 2   Quarter           6732 non-null   int64
 3   Registered_users  6732 non-null   int64
 4   App_opens         6732 non-null   int64
 5   Brand             6732 non-null   object
 6   Brand_count       6732 non-null   int64
 7   Brand_percentage  6732 non-null   float64
dtypes: float64(1), int64(5), object(2)
memory usage: 420.9+ KB

In [50]:
Agg_User_df['Brand'].unique()

array(['Xiaomi', 'Samsung', 'Vivo', 'Oppo', 'OnePlus', 'Realme', 'Apple',
       'Motorola', 'Lenovo', 'Huawei', 'Others', 'Tecno', 'Gionee',
       'Infinix', 'Asus', 'Micromax', 'HMD Global', 'Lava', 'COOLPAD',
       'Lyf'], dtype=object)

In [51]:
Agg_User_df.head()

,State,Year,Quarter,Registered_users,App_opens,Brand,Brand_count,Brand_percentage
0,Andaman & Nicobar Islands,2018,1,6740,0,Xiaomi,1665,0.247033
1,Andaman & Nicobar Islands,2018,1,6740,0,Samsung,1445,0.214392
2,Andaman & Nicobar Islands,2018,1,6740,0,Vivo,982,0.145697
3,Andaman & Nicobar Islands,2018,1,6740,0,Oppo,501,0.074332
4,Andaman & Nicobar Islands,2018,1,6740,0,OnePlus,332,0.049258

***Map_User***

In [52]:
Map_User_path = "D:/D26_Files/Phonepe_Analytics/pulse/data/map/user/hover/country/india/state/"
Map_User_state_list = os.listdir(Map_User_path)

Map_User_data = {'State':[], 'Year':[], 'Quarter':[], 'District':[], 'Registered_users':[], 'App_opens':[] }

for state_name in Map_User_state_list:
    state_path = Map_User_path + state_name + "/"
    Map_User_yr = os.listdir(state_path)

    for year in Map_User_yr:
        year_path = state_path + year + "/"
        Map_User_yr_list = os.listdir(year_path)

        for quarter_file in Map_User_yr_list:
            quarter_path = year_path + quarter_file
            with open(quarter_path, 'r') as Data:
                D = json.load(Data)

            for district, values in D['data']['hoverData'].items():
                
                reg_users = values['registeredUsers']
                app_opens = values['appOpens']
                

                Map_User_data['State'].append(state_name)
                Map_User_data['Year'].append(year)
                Map_User_data['Quarter'].append(int(quarter_file.strip('.json')))
                Map_User_data['District'].append(district)
                Map_User_data['Registered_users'].append(reg_users)
                Map_User_data['App_opens'].append(app_opens)
                

Map_User_df = pd.DataFrame(Map_User_data)

In [53]:
Map_User_df.head()

,State,Year,Quarter,District,Registered_users,App_opens
0,andaman-&-nicobar-islands,2018,1,north and middle andaman district,632,0
1,andaman-&-nicobar-islands,2018,1,south andaman district,5846,0
2,andaman-&-nicobar-islands,2018,1,nicobars district,262,0
3,andaman-&-nicobar-islands,2018,2,north and middle andaman district,911,0
4,andaman-&-nicobar-islands,2018,2,south andaman district,8143,0

In [54]:
Map_User_df.shape

(20608, 6)

In [55]:
Map_User_df.describe()

            Quarter  Registered_users     App_opens
count  20608.000000      2.060800e+04  2.060800e+04
mean       2.505435      4.301338e+05  1.952097e+07
std        1.118048      8.148492e+05  4.004047e+07
min        1.000000      2.200000e+01  0.000000e+00
25%        2.000000      6.208525e+04  4.839385e+05
50%        3.000000      1.995320e+05  5.946804e+06
75%        4.000000      4.896048e+05  2.191529e+07
max        4.000000      1.812748e+07  1.137875e+09

In [56]:
Map_User_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20608 entries, 0 to 20607
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   State             20608 non-null  object
 1   Year              20608 non-null  object
 2   Quarter           20608 non-null  int64
 3   District          20608 non-null  object
 4   Registered_users  20608 non-null  int64
 5   App_opens         20608 non-null  int64
dtypes: int64(3), object(3)
memory usage: 966.1+ KB

In [57]:
Map_User_df.isnull().sum()

State               0
Year                0
Quarter             0
District            0
Registered_users    0
App_opens           0
dtype: int64

In [58]:
Map_User_df['Year'] = Map_User_df['Year'].astype(int)
Map_User_df['District'] = Map_User_df['District'].str.title()
Map_User_df['State'] = Map_User_df['State'].str.replace('-', ' ').str.title()

In [59]:
Map_User_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20608 entries, 0 to 20607
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   State             20608 non-null  object
 1   Year              20608 non-null  int64
 2   Quarter           20608 non-null  int64
 3   District          20608 non-null  object
 4   Registered_users  20608 non-null  int64
 5   App_opens         20608 non-null  int64
dtypes: int64(4), object(2)
memory usage: 966.1+ KB

In [60]:
Map_User_df.head()

,State,Year,Quarter,District,Registered_users,App_opens
0,Andaman & Nicobar Islands,2018,1,North And Middle Andaman District,632,0
1,Andaman & Nicobar Islands,2018,1,South Andaman District,5846,0
2,Andaman & Nicobar Islands,2018,1,Nicobars District,262,0
3,Andaman & Nicobar Islands,2018,2,North And Middle Andaman District,911,0
4,Andaman & Nicobar Islands,2018,2,South Andaman District,8143,0

**SQL Database Creation**

In [61]:
%pip install python-dotenv pymysql sqlalchemy

Requirement already satisfied: python-dotenv in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (1.1.1)
Requirement already satisfied: pymysql in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (1.1.2)
Requirement already satisfied: sqlalchemy in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (2.0.43)
Requirement already satisfied: greenlet>=1 in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\dharshan\documents\venvs\phonepe_venv\lib\site-packages (from sqlalchemy) (4.15.0)
Note: you may need to restart the kernel to use updated packages.

In [64]:
from sqlalchemy import create_engine
from dotenv import load_dotenv

load_dotenv()

user = os.getenv("DB_USER")
password = os.getenv("DB_PASSWORD")
host = os.getenv("DB_HOST")
port = os.getenv("DB_PORT")
db = os.getenv("DB_NAME")


phonepe_engine = create_engine(f"mysql+pymysql://{user}:{password}@{host}:{port}/{db}")


Agg_Transaction_df.to_sql(name='agg_transaction', con = phonepe_engine, if_exists = 'replace', index = False)

Map_Transaction_df.to_sql(name='map_transaction', con = phonepe_engine, if_exists = 'replace', index = False)

Top_Transaction_df.to_sql(name='top_transaction', con = phonepe_engine, if_exists = 'replace', index = False)

Insurance_Transaction_df.to_sql(name='insurance_transaction', con = phonepe_engine, if_exists = 'replace', index = False)

Agg_User_df.to_sql(name='agg_user', con = phonepe_engine, if_exists = 'replace', index = False)

Map_User_df.to_sql(name='map_user', con = phonepe_engine, if_exists = 'replace', index = False)

20608